snlkuharlocal/src/Catalogs/ВнешниеОтчеты/ВнешниеОтчеты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВнешниеОтчеты</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ПолныйПуть</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяФайла</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяТЧ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидОбработки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяФормы</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОбъекта</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>УровеньДоступа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СхемаКомпоновки</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользованиеЗапрещено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьПакетОтображаемыхДокументов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Удалено_Избранное</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОбработкиУпр</name>
    <type>
      <types>EnumRef.ВидыДополнительныхОтчетовИОбработок</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Роли</name>
    <attributes>
      <name>Роль</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Полномочия</name>
    <attributes>
      <name>Полномочие</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ПолномочияПользователей</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Пользователи</name>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Контрагенты</name>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

snlkuharlocal/src/Catalogs/ВнешниеОтчеты/ManagerModule.bsl
Функция ПолучитьОбработкуПоКоду(КодОбработки) Экспорт
	Результат			= МаркировкаКС.СтруктураРезультата(Ложь);
	
	ЭлементОбработки	= Справочники.ВнешниеОтчеты.НайтиПоКоду(КодОбработки);
	
	Если ЭлементОбработки.Пустая() Тогда                       
		ТекстОшибки = СтрШаблон("Не найден элемент справочника 'Внешние обработки' с кодом: '%1' !", КодОбработки);
		Результат.Ошибки.Добавить(ТекстОшибки);		
		Возврат Результат
	КонецЕсли;
	
	ЗаписатьДатуИспользованияВнешнегоОтчёта(ЭлементОбработки);	
	
	ИмяОбработки 		= ЭлементОбработки.ИмяФайла;
	ИмяФайлаОбработки   = "";
	
	Внешняя = Ложь;
	Если СтрНачинаетсяС(ИмяОбработки, "ВН_") Тогда
		ИмяОбработки	= Сред(ИмяОбработки,4);	
		Внешняя			= Истина;
	Иначе			
		ИмяФайлаОбработки = ПолучитьИмяФалаОбработки(ЭлементОбработки);
		
		Файл	= Новый Файл(ИмяФайлаОбработки);
		Если Файл.Существует() Тогда
			Внешняя = Истина;
		КонецЕсли;			
	КонецЕсли; 
	
	Обработка = Неопределено;
	
	Если Внешняя Тогда		
		Обработка = ВнешниеОбработки.Создать(ИмяФайлаОбработки);
	Иначе
		Если Метаданные.Обработки.Найти(ИмяОбработки)<>Неопределено Тогда
			Обработка = Обработки[ИмяОбработки].Создать();	
		КонецЕсли;
	КонецЕсли;	                  
	
	Если Обработка = Неопределено Тогда
		ТекстОшибки = СтрШаблон("Обработка: '%1' не обнаружена !", ИмяОбработки);
		Результат.Ошибки.Добавить(ТекстОшибки);
	Иначе        
		Результат.Данные = Обработка;	
	КонецЕсли;
	
	Результат.Успешно = (Результат.Ошибки.Количество() = 0);
	
	Возврат Результат;	
КонецФункции //ПолучитьОбработкуПоКоду(КодОбработки) Экспорт

Функция ПолучитьИмяФалаОбработки(ЭлементОбработки)
	Если ЭлементОбработки.ВидОбработки = "Печать" Тогда
		ДопКаталог = "PrnForms\";			
	ИначеЕсли ЭлементОбработки.ВидОбработки = "Заполнить" Тогда
		ДопКаталог = "FillForms\";						
	ИначеЕсли ЭлементОбработки.ВидОбработки = "Подбор" Тогда
		ДопКаталог = "SelForms\";									
	Иначе
		ДопКаталог = "";		
	КонецЕсли;
	
	Расширение = ?(ЭлементОбработки.ВидОбработки = "Отчет", ".erf", ".epf");
	
	ИмяФайлаОбработки	= СокрЛП(?(ЭлементОбработки.ПолныйПуть, ЭлементОбработки.ИмяФайла, Константы.КаталогВнешнихОтчетов.Получить() + ДопКаталог + ЭлементОбработки.ИмяФайла));
	Если Прав(ИмяФайлаОбработки,4) <> Расширение Тогда
		ИмяФайлаОбработки = ИмяФайлаОбработки + Расширение;		
	КонецЕсли;	
	
	Возврат ИмяФайлаОбработки;
КонецФункции //ПолучитьИмяФалаОбработки(ЭлементОбработки)
